In [22]:
import pandas as pd
import numpy as np

data ={'eng':[10,30,50,70],
      'kor':[20,40,60,80],
      'math':[90,50,20,70]}
df = pd.DataFrame(data, index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [ ]:
# 산술, 관계, 논리

In [2]:
df+2

   eng  kor  math
a   12   22    92
b   32   42    52
c   52   62    22
d   72   82    72

In [3]:
df*2

   eng  kor  math
a   20   40   180
b   60   80   100
c  100  120    40
d  140  160   140

In [4]:
df['eng'] = 2

In [5]:
df

   eng  kor  math
a    2   20    90
b    2   40    50
c    2   60    20
d    2   80    70

In [6]:
df['eng'] = [1,2,3,4]
df

   eng  kor  math
a    1   20    90
b    2   40    50
c    3   60    20
d    4   80    70

In [ ]:
import pandas as pd
import numpy as np

data ={'eng':[10,30,50,70],
      'kor':[20,40,60,80],
      'math':[90,50,20,70]}
df = pd.DataFrame(data, index=['a','b','c','d'])
df

In [12]:
# df['eng'] 결과는 시리즈 
# 시리즈는 리스트와 동일한 개념이므로 'eng'컬럼만 2를 더한 값으로 변경됨
# 특정 컬럼만 연산할 때
df['eng'] = df['eng'] + 2
df

   eng  kor  math
a   12   20    90
b   32   40    50
c   52   60    20
d   72   80    70

In [ ]:
import pandas as pd
import numpy as np

data ={'eng':[10,30,50,70],
      'kor':[20,40,60,80],
      'math':[90,50,20,70]}
df = pd.DataFrame(data, index=['a','b','c','d'])
df

In [14]:
df.loc['b'] = 2

In [15]:
df

   eng  kor  math
a   10   20    90
b    2    2     2
c   50   60    20
d   70   80    70

In [16]:
df.loc['b'] = [1,2,3]

In [17]:
df

   eng  kor  math
a   10   20    90
b    1    2     3
c   50   60    20
d   70   80    70

In [18]:
# 특정 row만 연산할 때
df.loc['b'] = df.loc['b'] + 2
df

   eng  kor  math
a   10   20    90
b    3    4     5
c   50   60    20
d   70   80    70

In [19]:
# 특정 컬럼+row 데이터만 수정하고 싶을 때 2차원 데이터로 준다
df.loc['c':,'kor':] = [[1,2],[3,4]]

In [20]:
df

   eng  kor  math
a   10   20    90
b    3    4     5
c   50    1     2
d   70    3     4

In [21]:
df.loc['c':,'kor':] = df.loc['c':,'kor':]+2
df

   eng  kor  math
a   10   20    90
b    3    4     5
c   50    3     4
d   70    5     6

In [24]:
import pandas as pd
import numpy as np

data ={'eng':[10,30,50,70],
      'kor':[20,40,60,80],
      'math':[90,50,20,70]}
df = pd.DataFrame(data, index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [26]:
# 논리나 관계 연산자를 확인하려면 boolean 인덱싱에 대한 개념 필요
# 행단이 boolean indexing
# True에 해당되는 행만 출력
df[[True,False,True,True]]

   eng  kor  math
a   10   20    90
c   50   60    20
d   70   80    70

In [27]:
df['eng'] > 30

a    False
b    False
c     True
d     True
Name: eng, dtype: bool

In [28]:
df[df['eng'] > 30] #df[False,False,True,True]

   eng  kor  math
c   50   60    20
d   70   80    70

In [29]:
(df['kor'] == 40) | (df['kor'] == 80)

a    False
b     True
c    False
d     True
Name: kor, dtype: bool

In [30]:
df[(df['kor'] == 40) | (df['kor'] == 80)]
# sr = df['kor']로 치환해도 됨

   eng  kor  math
b   30   40    50
d   70   80    70

In [31]:
# query: 관계,논리 연산 코드를 간편하게 작성할 수 있는 DataFrame의 멤버 함수
df.query('eng>30')

   eng  kor  math
c   50   60    20
d   70   80    70

In [32]:
# 파이썬의 논리연산자를 바로 사용가능
df.query('kor==40 or kor==80')

   eng  kor  math
b   30   40    50
d   70   80    70

In [33]:
# df[(df['kor'] >= 20) && (df['kor'] <= 50)]
df.query('20<=kor<=50')

   eng  kor  math
a   10   20    90
b   30   40    50

In [34]:
# 변수를 활용해야하는 경우 포맷스트링을 이용해서 쿼리를 완성해주면 된다.
n=30
s=f'n={n}'
s

'n=30'

In [35]:
n=30
df.query(f'eng>{n}') #'eng>30'

   eng  kor  math
c   50   60    20
d   70   80    70